Repository: sottam/simus
Catalog: locale/simus.*.po
Languages: es

source: ADD instruction adds the contents of the memory position to the contents of the accumulator. The result is stored in the accumulator.
es: La instrucción ADD suma al acumulador el contenido de una posición en la memoria indicada por el operando. El resultado se almacena en el acumulador.

source: AND performs a binary "AND" between the accumulator and the contents of a memory location indicated by the operand.
es: La instrucción AND realiza un "AND" binario entre el acumulador y el contenido de una posición de memoria indicada por el operando.

source: ; Author:
es: ; Autor:

source: Strings start and end with quotation marks.
es: Las cadenas empiezan y terminan por comillas.

source: Malformed comment or parameter
es: Comentario o parámetro mal formado

source: Compilation Report:
es: Compilación (ensamblado) del texto

source: ; Date:
es: ; Fecha:

source: DB (define bytes) pseudo-instruction loads the value defined by the operand into the current memory position.
es: La pseudo-instrucción DB (define bytes) carga en esta palabra de memoria el valor definido por el operando.

source: Save before exiting?
es: ¿Desea guardar antes de salir?

source: A label is a name given to the current memory position. The name must be followed by a colon.
es: Una etiqueta es un nombre dado a la posición de memoria siguiente. El nombre es seguido por dos puntos.

source: DS (define storage) pseudo-instruction reserves in memory the amount of bytes specified by the operand.
es: La pseudo-instrucción DS (define storage) reserva un número de palabras en la memoria definida por el operando.

source: END pseudo-instruction indicates that the source program has ended. This operand is used to pre-load the PC with the starting address of the program execution.
es: La pseudo-instrucción END indica que el programa fuente ha terminado. El operando se utiliza para precargar el PC con la dirección inicial de ejecución del programa.

source: EQU (equate) pseudo-instruction assigns an alias to a numeric value. This command is often used to define a specific memory address to a program variable. For example, to position the variable X into F0H address you shall use: X EQU 0F0H
es: La pseudo-instrucción EQU (equate) asigna un nombre a un cierto valor. Este comando se utiliza con frecuencia para especificar variables que se colocan en cierta dirección de memoria. Por ejemplo para colocar la variable x en la dirección hexa f0 use: X EQU 0F0H

source: Error when loading file
es: Error al cargar el archivo

source: This instruction has no parameters
es: Esta instrucción no tiene parámetros

source: HLT (halt) stops the machine.
es: La instrucción HLT (halt) para la máquina.

source: IN (input) loads the value read into an external device indicated by the operand in the accumulator. In this simulator the devices are: keys (address 0) and the status of "data available " of the keys (address 1).
es: La instrucción IN (input) carga en el acumulador el valor leído en un dispositivo externo indicado por el operando.

source: Insert
es: Insertar

source: Illegal instruction
es: Instrucción no es válida

source: JC (jump if carry) transfers program execution to the memory address given in the operand, only if carry flag equals '1".
es: La instrucción JC (jump if carry) desvía la ejecución del programa a la dirección indicada por el operando ender, sólo cuando la última operación aritmética realizada no correspondió a los 8 bits del destino.

source: JMP (jump) transfers program execution to the memory address given in the operand, (i.e., it places this address into PC register).
es: La instrucción JMP (jump) desvía la ejecución del programa a la dirección indicada por el operando (es decir, coloca esta dirección en el registrador PC).

source: JN (jump if negative) transfers program execution to the memory address given in the operand, only when the last operation performed produced a value with bit 7 connected.
es: La instrucción JN (jump if negative) desvía la ejecución del programa a la dirección indicada por el operando, sólo cuando la última operación realizada produjo un valor con el bit 7 conectado.

source: JNC (jump if not carry) transfers program execution to the memory address given in the operand, only if carry flag equals '0".
es: La instrucción JNC (jump if not carry) desvía la ejecución del programa a la dirección indicada por el operando dirección, sólo cuando la última operación aritmética realizada fue en los 8 bits del destino.

source: JNZ (jump if not zero) transfers program execution to the memory address given in the operand, only when the last operation performed produced a nonzero value.
es: La instrucción JNZ (jump if not cero) desvía la ejecución del programa a la dirección indicada por el operando, sólo cuando la última operación realizada produjo un valor distinto de cero.

source: JSR (jump to subroutine) executes a subroutine call. To do this, transfer the 16 bits of the PC (Program Counter) to the stack and put in the PC the 16 bits indicated in the operand. The SP is incremented by 2.
es: La instrucción JSR (jump to subroutine) realiza una llamada de subrutina. Para ello, transfiere los 16 bits del PC (Program Counter) a la pila y coloca en el PC los 16 bits indicados en el operando. El SP se incrementa de 2.

source: JZ (jump if zero) transfers program execution to the memory address given in the operand, only when the last executed operation produced a zero value.
es: La instrucción JZ (jump if zero) desvía la ejecución del programa a la dirección indicada por el operando, sólo cuando la última operación realizada produjo un valor cero.

source: LDA (load accumulator) assigns the accumulator the contents of the memory location indicated by the operand.
es: La instrucción LDA (load accumulator) asigna al acumulador el contenido de la posición de memoria indicada por el operando.

source: LDS (load from stack pointer) transfers the stack pointer to 16 bits in the memory indicated by the operand.
es: La instrucción LDS (load from stack pointer) transfiere el puntero de la pila (Stack Pointer) a 16 bits en la memoria indicada por el operando.

source: List
es: Listado

source: NOP (no operation) does nothing.
es: La instrucción NOP (no operation) no hace nada, se utiliza sólo para pasar tiempo.

source: New ACC value
es: Nuevo valor del ACC

source: New flag C value
es: Nuevo valor del flag C

source: New flag N value
es: Nuevo valor del flag N

source: New flag Z value
es: Nuevo valor del flag Z

source: New PC value
es: Nuevo valor del PC

source: Number of errors found:
es: Número de errores encontrados:

source: Invalid operand
es: Operando inválido

source: Malformed operand
es: Operando mal formado

source: OR performs a logical "OR" between the accumulator and the contents of a memory location indicated by the operand.
es: La instrucción OR realiza un "or " bit a bit entre el acumulador y el contenido de una posición de memoria indicada por el operando.

source: ORG (origin) pseudo-instruction indicates to the assembler the memory location where the next instruction will be placed.
es: La pseudo-instrucción ORG (origin) indica al ensamblador la posición de memoria donde se colocará la siguiente instrucción.

source: Invalid source
es: Origen no válido

source: This parameter type is incompatible with the instruction
es: El tipo de parámetro es incompatible con la instrucción

source: OUT (output) transfers the accumulator value to an external device indicated by the operand. In this simulator the only available device is a display (address 0).
es: La instrucción OUT (output) transfiere el valor del acumulador a un dispositivo externo indicado por el operando

source: EQU Parameter with error
es: Parámetro de EQU con error

source: Comments start with a semicolon.
es: Los comentarios se empiezan por punto y coma.

source: The POP (pop from stack) command copies the top of the stack (8 bits) to the accumulator. The SP is decremented by 1.
es: La instrucción POP (pop from stack), trae al acumulador la parte superior de la pila (8 bits). El SP es decrecido de 1.

source: Please, fill in the operand.
es: Por favor, llene el operando.

source: Please fill in the label.
es: Por favor, rellene la etiqueta.

source: ; Program:
es: ; Programa:

source: Pseudo-instruction does not permit immediate neither indirect
es: Pseudo-instrucción no permite inmediato ni indirecto

source: The PUSH (push to stack) command copies the contents of the accumulator to the top of the stack. The SP is incremented by 1.
es: La instrucción PUSH (push to stack), coloca el contenido del acumulador en la parte superior de la pila. El SP se incrementa de 1.

source: RET (return from subroutine) instruction returns from a JSR call. In other words, it transfers 16 bits of the stack to the PC, and updates the SP. The SP is decremented by 2.
es: La instrucción RET (return from subroutine) devuelve una llamada JSR. Para ello, transfiere al PC 16 bits de la pila, y actualiza el SP. El SP es decrecido de 2.

source: - duplicate label
es: - etiqueta duplicada

source: SBC (subtract with carry) subtracts from the accumulator the contents of a memory location indicated by the operand, decreasing it if the carry is on.
es: La instrucción SBC (subtract con carry) sustrae del acumulador el contenido de una posición de memoria indicada por el operando, y lo decrece si el bit de acarreo (C) está encendido.

source: The SHA (shift right arithmetic) instruction shifts the accumulator bits to the right (the same as divide by 2). Bit 7 is kept the same. Bit 0 (which would be lost) is stored in the Carry.
es: La instrucción SRA (shift right aritmético) desplaza los bits del acumulador a la derecha (es decir, divide por 2). El bit 7 se mantiene igual. El bit 0 (que se pierde) se almacena en el bit de acarreo (C).

source: SHL (shift left) instruction shifts the accumulator bits to the left (the same as multiplying by 2). Bit 0 is set to 0. Bit 7 (which would be lost) is stored in the Carry.
es: La instrucción SHL (shift left) desplaza los bits del acumulador hacia la izquierda (es decir, se multiplica por 2). El bit 0 recibe el valor 0. El bit 7 (que se pierde) se almacena en el bit de acarreo (C).

source: SHR (shift right) instruction shifts the accumulator bits to the right (the same as dividing by 2). Bit 7 is set to 0. Bit 0 (which would be lost) is stored in the Carry.
es: La instrucción SHR (shift right) desplaza los bits del acumulador a la derecha (es decir, divide por 2). El bit 7 recibe el valor 0. El bit 0 (que se pierde) se almacena en el bit de acarreo (C).

source: Symbol Line Address
es: Símbolo Línea Dirección

source: Sapiens-8 processor simulator
es: Simulador del procesador Sapiens

source: STA (store accumulator) transfers the value of the accumulator to the memory location indicated by the operand.
es: La instrucción STA (Store Accumulator) transfiere el valor del acumulador a la posición de memoria indicada por el operando.

source: STS (store into stack pointer) transfers 16 bits of the memory indicated by the operand to the stack pointer (Stack Pointer).
es: La instrucción STS (Store into stack pointer) transfiere 16 bits de la memoria indicada por el operando para el puntero de la pila (Stack Pointer).

source: SUB (subtract) instruction subtracts from the accumulator the contents of a memory location indicated by the operand.
es: La instrucción SUB (subtract) sustrae del acumulador el contenido de una posición de memoria indicada por el operando.

source: TRAP simulates an operating system function, to simplify input and output programming.
es: La instrucción TRAP simula la ejecución de una llamada al sistema operativo para simplificar la programación de entrada y salida.

source: Are you sure?
es: ¿Todo fue salvó?

source: Typed value inconsistent with specified base
es: Valor digitado incoherente con la base especificada

source: XOR (exclusive OR) performs a logical "xor" between the accumulator and the contents of a memory location indicated by the operand.
es: La instrucción XOR (exclusive OR) realiza un "xor " lógico entre el acumulador y el contenido de una posición de memoria indicada por el operando.

source: of symbol table
es: de la tabla de símbolos

source: In
es: En

source: - Sapiens-8 processor simulator
es: - Simulador del procesador Sapiens

# resstring.s___sapiens8
source: SAPIENS-8
es: SAPIENS

source: ********* Warning:
es: ********* Advertencia:

source: About SimuS
es: Acerca del SimuS

source: This simulator is compatible with Neander-X processor.
es: Este simulador es compatible con el procesador Neander-X.

source: Simus - Didactic Simulator for computer architecture teaching.
es: SimuS - Simulador didáctico para la enseñanza de la arquitectura de computadoras

source: Version 1.1 - February/2018
es: Versión 1.1 - Febrero 2018

source: Comment
es: comentarios

source: Insert into source program
es: Incluir en el programa fuente

# tformautomonta.b_rotulo.caption
source: Label
es: Etiqueta

# tformautomonta.caption
source: Guided Programming
es: Creación tutorada de programas

source: Immediate
es: Inmediato

source: Indirect
es: Indirecto

source: Description
es: Descripción:

source: Operand
es: Operativo

# tformautomonta.l_rotulo.caption
source: Label
es: Etiqueta

source: Console
es: Consola

source: Hide
es: Ocultar

source: Clean
es: limpio

source: Convert
es: Convertir

# tformhex.caption
source: Base Converter
es: Conversión entre bases

# tformhex.de_binario.caption
source: Binary
es: Binario

source: From
es: De

source: To
es: Para

# tformhex.para_binario.caption
source: Binary
es: Binario

source: Open
es: Abrir

source: Open Example
es: Abrir ejemplo

source: Load Hex
es: Cargar Hexa

source: &Ajuda
es: Ayuda

source: File
es: Archivo

source: Programming Guide
es: Tutor de programación

source: BreakPoint Select a line on debugging, then click here.
es: BreakPoint Seleccione una línea en la depuración, luego haga clic aquí.

source: Enter
es: Entrar

source: Run
es: Ejecutar

source: Halt
es: Interrumpir

source: Step-by-Step
es: Paso a paso

# tformprincipal.b_zera.caption
source: Reset
es: limpio

source: SimuS - Sapiens-8 Processor Simulator
es: SimuS - Simulador del procesador Sapiens

source: Hex
es: Hexa

source: Fast
es: Rápido

source: Paste
es: Pegar

source: Compilation
es: Compilación

source: Compile
es: Compilar

source: C&onsole
es: Consola

# tformprincipal.conversordebases1.caption
source: Base Converter
es: Convertidor de bases

source: Copy
es: Copiar

source: Copiar seleção
es: Copiar selección

source: Cortar seleção
es: Cortar selección

source: Undo
es: Deshacer

source: Display
es: Visor

source: Editing
es: Edición

source: Edit
es: Editar

source: Debugging
es: ejecución

source: Sair
es: Salir

# tformprincipal.l_banner.caption
source: SAPIENS-8
es: SAPIENS

source: Address
es: Dirección

source: Running:
es: Ejecutando:

source: Instruction:
es: Instrucción:

source: New value
es: Nuevo valor

source: Registers
es: Registros

source: Value:
es: Valor:

source: Novo
es: Nuevo

source: New
es: Nuevo

source: Colar
es: Pegar

# tformprincipal.programaotutorada1.caption
source: Guided Programming
es: Programación Tutorizada

source: Ready
es: Listo

source: Cut
es: Cortar

source: Exit
es: Salir

source: Save
es: Guardar

source: Save As
es: Guardar Como

source: Dump Hex
es: Descargar Hexa

source: Salvar
es: Guardar

source: &Sobre o programa
es: Acerca del SimuS

source: Clear Memory
es: Limpiar memoria
